<template>
  <div>
    <div class="text-center font-semibold text-5xl">
      Result
    </div>
    <img src="../assets/images/check.svg" class="w-32 mx-auto" alt="" />
    <div class="text-center mt-4">
      <b-button
        class="bg-blue-500 hover:bg-blue-400 border-b-4 border-blue-700 hover:border-blue-500 rounded w-1/4 mx-3"
        >Download classify data</b-button
      >
      <b-button
        class="bg-blue-500 hover:bg-blue-400 border-b-4 border-blue-700 hover:border-blue-500 rounded w-1/4 mx-3"
        >Download graph</b-button
      >
    </div>
    <div class="row w-full mt-5">
      <div class="w-2/3 mx-auto">
        <canvas id="chart1" height="50" width="100"></canvas>
      </div>
    </div>
    <div class="row w-full mt-5">
      <div class="w-1/2 mx-auto">
        <canvas id="chart2" height="50" width="100"></canvas>
      </div>
      <div class="w-1/2 mx-auto">
        <canvas id="chart3" height="50" width="100"></canvas>
      </div>
    </div>
  </div>
</template>

<script>
import Chart from "chart.js";
export default {
  components: {},
  mounted: function() {
    // ในกรณีที่ response data มาจาก model Tag suggesstion
    var keyData1 = Object.keys(this.chartData[0].data[0]);
    var arrayData1 = Object.values(this.chartData[0].data[0]);
    var ctx1 = document.getElementById("chart1").getContext("2d");
    var bar = new Chart(ctx1, {
      type: "bar",
      data: {
        labels: keyData1,
        datasets: [
          {
            label: "# of Vote",
            data: arrayData1
          }
        ]
      }
    });
    console.log(bar);

    for (var i in this.chartData[1].data) {
      var thisPolaris = this.chartData[1].data[i].polarity;
      this.polarityData[thisPolaris] += 1;
    }
    var ctx2 = document.getElementById("chart2").getContext("2d");
    var pie = new Chart(ctx2, {
      type: "pie",
      data: {
        labels: Object.keys(this.polarityData),
        datasets: [
          {
            label: "# of Vote",
            data: Object.values(this.polarityData)
          }
        ]
      }
    });
    console.log(pie);
    var ctx3 = document.getElementById("chart3").getContext("2d");
    var bar2 = new Chart(ctx3, {
      type: "pie",
      data: {
        labels: Object.keys(this.polarityData),
        datasets: [
          {
            label: "# of Vote",
            data: Object.values(this.polarityData)
          }
        ]
      }
    });
    console.log(bar2);
  },
  data() {
    return {
      polarityData: {
        positive: 0,
        negative: 0,
        neutral: 0
      },
      chartData: [
        {
          name: "ท่านมีอะไรอยากบอกพวกเราหรือไม่??",
          data: [
            {
              ร้านอาหาร: 1,
              ลดความอ้วน: 1,
              โภชนาการ: 1,
              ฟิตเนส: 1,
              ชีวิตวัยรุ่น: 15,
              หาเพื่อน: 6,
              เพื่อนวัยเรียน: 2,
              เที่ยวทะเล: 1,
              ภาคใต้: 1,
              ใบขับขี่: 1,
              เช้านี้ที่หมอชิต: 1,
              ความรักวัยรุ่น: 7,
              โทรศัพท์มือถือ: 3,
              ฟุตบอลไทย: 3,
              ไทยพรีเมียร์ลีก: 2,
              สโมสรฟุตบอลไทย: 2,
              หุ้น: 8,
              การเรียน: 22,
              มหาวิทยาลัย: 16,
              แอดมิชชั่น: 3,
              แนะแนวการศึกษา: 7,
              ตกแต่งคอนโดมิเนียม: 1,
              คอนโดมิเนียม: 1,
              อสังหาริมทรัพย์: 1,
              มหาวิทยาลัยรามคำแหง: 2,
              การศึกษา: 12,
              จุฬาลงกรณ์มหาวิทยาลัย: 3,
              ปัญหาความรัก: 2,
              เพศที่สาม: 1,
              ประสบการณ์ชีวิตคู่: 1,
              รักสามเส้า: 1,
              อิเล็กทรอนิกส์: 1,
              คอมพิวเตอร์: 1,
              มนุษย์เงินเดือน: 1,
              การลงทุน: 1,
              เพลง: 3,
              เพลงสากล: 2,
              "line let s get rich": 1,
              มอเตอร์ไซค์: 1,
              ฟุตบอลต่างประเทศ: 5,
              ฟุตบอล: 6,
              พรีเมียร์ลีก: 5,
              วอลเลย์บอล: 6,
              ศาลาคนโสด: 1,
              โรงเรียน: 3,
              ปัญหาชีวิต: 5,
              หนังสือ: 2,
              ซอฟต์แวร์: 1,
              ความรักวัยทำงาน: 1,
              กวดวิชา: 2,
              กระทรวงศึกษาธิการ: 1,
              มหาวิทยาลัยเกษตรศาสตร์: 1,
              ภาษาเกาหลี: 1,
              คณะมนุษยศาสตร์: 1,
              ความงาม: 3,
              แพทย์: 1,
              กายภาพบำบัด: 1,
              โรงพยาบาล: 1,
              รถยนต์: 1,
              nissan: 1,
              สมาร์ทโฟน: 2,
              "": 2,
              ais: 1,
              "mobile operator": 1,
              รถไฟ: 1,
              ครอบครัว: 1,
              ศัลยกรรมความงาม: 1,
              การโฆษณา: 1,
              ดาราศาสตร์: 1,
              อวกาศ: 1,
              ศาลาคนเศร้า: 1,
              ดูแลและซ่อมแซมบ้าน: 1,
              เครื่องสำอาง: 1,
              คลินิกความงาม: 1,
              เรื่องลึกลับ: 1,
              ติวเตอร์: 1,
              ธนาคาร: 1,
              ธนาคารไทยพาณิชย์: 1,
              "mobile application": 1,
              "scb easy": 1,
              ร้องทุกข์: 2,
              มิวสิควิดีโอ: 1,
              กิจกรรมสมาชิก: 1,
              แฟชั่น: 1,
              คุ้มครองผู้บริโภค: 1,
              ปัญหาวัยรุ่น: 1,
              พยาบาล: 1,
              งานโรงพยาบาล: 1
            }
          ]
        },
        {
          name: "ท่านมีอะไรอยากบอกพวกเราหรือไม่??",
          data: [
            {
              name:
                "รีวิวส่วนใหญ่มักมีแต่เกรดดีๆ พอไปเรียนจริงแล้วไม่ได้ตามนั้น เลยอยากให้เราเพิ่มรีวิวเองได้ แล้วก็มีคอมเม้นจากคนอื่นๆได้",
              polarity: "positive"
            },
            {
              name:
                "อินดี้ ไทยจีโอ คือสมบัติของมหาลัยเรา อย่าให้มันหายไป เอือกกกกกกก",
              polarity: "negative"
            },
            {
              name:
                "อยากให้มีจริงๆค่ะ เพราะหารีวิวยากมากกกกกกก บางทีมันก็ไม่เป็นหลักเป็นแหล่ง บางทีรุ่นพี่โพสต์หน้าเฟซตัวเองแล้วไม่ได้เปิดพับลิกอะไรแบบนี้ค่ะ แล้วหาคนตอบในกลุ่มในเฟซเดี๋ยวนี้ก็ยิ่งยาก ไม่ค่อยมีคนเข้ามาตอบกันแล้ว",
              polarity: "negative"
            },
            {
              name: "จุฟๆ",
              polarity: "neutral"
            },
            {
              name: "ไม่นะ",
              polarity: "neutral"
            },
            {
              name: "วิชาเลือกของคณะบริหาร อยากให้มีโอกาสเลือกได้มากกว่านี้",
              polarity: "neutral"
            },
            {
              name:
                "ขอให้โปรเจคของน้องผ่านไปได้ด้วยดีนะคะ ถึงพี่จะจบจากที่นี่ไปแล้วแต่อยากทำแบบสอบถามนี้ แล้วก็ขอให้แบบสอบถามนี้มีประโยชน์ก็น้องรุ่นต่อๆ ไปด้วยนะคะ ขอบคุณค่ะ",
              polarity: "positive"
            },
            {
              name: "ระบบ ว่าเรียนวิชาเลือกครบหรือยัง",
              polarity: "neutral"
            },
            {
              name: "ต้องการให้ไม่ซับซ้อน เข้าถึงง่าย",
              polarity: "positive"
            },
            {
              name: "ขอบคุณที่ทำอะไรแบบนี้ออกมาจ้า เป็นประโยชน์มากๆเลย",
              polarity: "positive"
            },
            {
              name: "อยากได้รายละเอียดเยอะๆ และวิชาที่ติดดาว ให้คะแนนเป็นดาว",
              polarity: "positive"
            },
            {
              name:
                "https://docs.google.com/spreadsheets/d/1_20jscySDD_1o-2AmFLQ16XLDCEe1Q0xwJOS7SuEAdU/edit#gid=0 รีวิวที่มีการส่งต่อๆกันในคณะไอที :)\nอยากให้มีแบบเลือกว่าตัวเองอยู่คณะนี้ชั้นปีนี้ต้องเก็บหมวดอะไรกี่หน่วยกิต มีแจ้งเป็นทิปว่าถ้าลงหมวดนี้เต็มหน่วยกิตแล้วลงอีกมันจะปัดเป็นหมวดเสรี ไรงี้",
              polarity: "positive"
            },
            {
              name: "สู้ๆนะครับ",
              polarity: "positive"
            },
            {
              name: "ไม่มีค้าบ\n",
              polarity: "neutral"
            },
            {
              name:
                "วิชาที่ใช่ไม่ได้เลือก วิชาที่เลือกก็ไม่ใช่ ต้องแย่งกันลงให้จบๆไป ดูไม่กี่อย่าง เกรดง่าย งานน้อย ไม่เข้มงวดเรื่องเข้าเรียน สอนดี",
              polarity: "positive"
            },
            {
              name:
                "ถ้าจะทำจริงควรมีให้หลากหลาย เพราะปัญหาที่เจอคือคนไม่ยอมบอกกันว่าวิชานั้นๆเป็นไง แต่ตัวเองก็อยากได้รีวิววิชา ควรมีระบบให้รีวิววิชาที่ตัวเองเคยลงมาแลกเปลี่ยนกันถ้าไม่เคยรีวิวก็ดูข้อมูลไม่ได้ เป็นต้น",
              polarity: "neutral"
            },
            {
              name:
                "ควรมีการระบุอัพเดทคชข้อมูลของผู้สอน และปีที่ได้เรียน จากผู้ที่เคยเรียน เพราะบางวิชา เมื่อเราหารีวิวแล้วของปีก่อนหรือเทอมก่อน คิดว่ามันน่าสนใจ แต่พอมาลงในเทอมปัจจุบัน กลับพบว่ามีการเปลี่ยนผู้สอน ทำให้เทคนิคและวิธีการสอนต่างกัน ซึ่งเป็นเรื่องน่าเสียดายที่เราตั้งใจจะลง แต่กลับมีการเปลี่ยนแปลงข้อมูล",
              polarity: "positive"
            },
            {
              name: "อย่าบอกจารย์นะ จุ๊ๆ",
              polarity: "neutral"
            },
            {
              name:
                "บางคณะวิชาเลือกมีให้เลือกน้อยเกินไปค่ะ บางวิชาถ้าอยากเรียนก็ไม่สามารถเรียนได้",
              polarity: "negative"
            },
            {
              name:
                "ปีนี้มีให้ลงวิขาเลือก1ตัว แต่ในหมวดที่บังคับลงดันมีวิขาให้เลือกแค่วิชาเดียว แบบนี้ก็เหมือนบังคับลง",
              polarity: "negative"
            },
            {
              name: "สู้ๆนะจ้ะ",
              polarity: "positive"
            },
            {
              name: "สู้ๆนะครับ <3",
              polarity: "positive"
            },
            {
              name:
                "เป็นสถาบันที่มีวิชาเลือกน้อยมากๆ หลายๆวิชาต่างคณะคือน่าเรียนมากแต่จำกัดเฉพาะคนในคณะ โดยเฉพาะสายภาษา วิชาเลือกก็เหมือนสิ่งที่น่าสนใจอีกอย่างของเรา อยากให้มีให้หลายหลาย เราอยากเรียนภาษาที่3อย่างญี่ปุ่นหรือเกาหลีคือหาไม่ได้เลย แอบอิจฉาม.อื่น การจะทำระบบสืบค้นคือดีมากๆ ค่ะ เพราะนี่ก็ลงได้เพราะถามจากรุ่นพี่เป็นส่วนใหญ่",
              polarity: "positive"
            },
            {
              name: "เราจะผ่านมันไปด้วยกันค้าบ",
              polarity: "neutral"
            },
            {
              name:
                "อยากได้ระบบที่หาข้อมูลที่ความน่าเชื่อถือ ช่วยในการตัดสินใจ และไม่ผิดหวัง",
              polarity: "positive"
            },
            {
              name: "บอกรหัสวิชาและภาคเรียนที่เปิดสอน",
              polarity: "neutral"
            },
            {
              name: "ไม่มี",
              polarity: "neutral"
            },
            {
              name:
                "ขอบคุณโปรเจคดีๆ ถ้าทำได้ก็ดี แต่อาจจะเหนื่อยหน่อย เป็นกำลังใจให้นะ แต่ถ้าทำนะ บางวิชาอาจไม่มีคนลงเลยก็ได้ ว้ะฮ่าๆ",
              polarity: "positive"
            },
            {
              name: "สู้ๆค่ะ พี่เฟิร์สสสสสสสสส",
              polarity: "positive"
            },
            {
              name:
                "ฟังก์ชั่นการเข้าสู่ระบบเพื่อเขียนรีวิว หมายถึงการล็อคอินไปเขียนใช่ไหม ถ้าใช่ก็อาจจะไม่ต้องสอบถามก็ได้ เพราะมันแค่การล็อคอิน ถ้าหมายถึงการเขียนรีวิว ก็ใช้คำนี้สั้น ๆ เลย คนจะได้ไม่สงสัยแบบนี้ด้วยครับ",
              polarity: "positive"
            },
            {
              name: "อิอิ",
              polarity: "neutral"
            },
            {
              name: "ระบบให้ดาว",
              polarity: "neutral"
            },
            {
              name: "สู้ๆ",
              polarity: "positive"
            },
            {
              name:
                "บอกด้วยว่าอ.อะไรเป็นผู้สอน เพราะวิชาเดิม แต่เปลี่ยนอ. ความยากง่ายก็จะเปลี่ยนไป",
              polarity: "negative"
            },
            {
              name: "สู้ๆฮะ",
              polarity: "positive"
            },
            {
              name: "ระบบกดโหวตกระทู้(ให้ดาว)",
              polarity: "neutral"
            },
            {
              name:
                "แนะนำว่าให้มีฟังก์ชันให้ search ได้จากว่าคณะของตัวเอง ลงอะไรได้บ้าง แล้วก็แนะนำว่าให้ดึงข้อมูลว่ามีวิชาอะไรบ้าง เรียนที่ไหน เวลาไหน อะไรพวกนี้จาก reg โดยตรงเลย ไม่ต้องมารอให้มี user เข้ามาทำการเพิ่มวิชาด้วยตนเองนะจ๊ะ จากพี่มงมง",
              polarity: "neutral"
            },
            {
              name: "easy to use dude",
              polarity: "neutral"
            },
            {
              name: "เว็บดูยากมากครับ เวลาที่จะเบือกวิชาเลือก",
              polarity: "negative"
            },
            {
              name:
                "อยากให้มีอธิบายว่าเรียนเกี่ยวกับอะไร เป็นยังไง ยังว่างอยู่มั้ย รับกี่คน",
              polarity: "neutral"
            },
            {
              name:
                "อยากให้บอกว่าเนื้อหาวิชานี้อาจารย์สอนยังไง มีเนื้อหาเกี่ยวกับอะไรบ้าง",
              polarity: "neutral"
            },
            {
              name:
                "อยากให้บอกเกี่ยวกับการเก็บคะแนน และหัวข้อที่จะเรียน อยากให้listมาเลย",
              polarity: "neutral"
            },
            {
              name:
                "ในระบบเก่าวิชาเลือกเสรีต้องไปหาเอง ถ้ามีโปรแกรมมาช่วยหาก็ดี",
              polarity: "positive"
            },
            {
              name: "บอกรายละเอียดวิชากับรีวิวอาจารย์",
              polarity: "neutral"
            },
            {
              name: "รีวิวอาจารย์ รีวิวเนื้อหาการเรียน",
              polarity: "neutral"
            },
            {
              name:
                "รู้สึกสนใจโปรเจคนี้นะคะ มันถือว่ามันเป็นการเปิดทางเลือกให้กับเด็กบางคนที่ไม่รู้ว่าวิชานี้ วิชานี้เรียนอะไร แล้วก็อยากให้แสดงความคิดว่าวิชานี้เป็นยังไง ครูดุมั้ย เรียนยากมั้ย",
              polarity: "negative"
            }
          ]
        },
        {
          name: "ท่านมีอะไรอยากบอกพวกเราหรือไม่??",
          data: [
            {
              name:
                "รีวิวส่วนใหญ่มักมีแต่เกรดดีๆ พอไปเรียนจริงแล้วไม่ได้ตามนั้น เลยอยากให้เราเพิ่มรีวิวเองได้ แล้วก็มีคอมเม้นจากคนอื่นๆได้",
              polarity: "positive"
            },
            {
              name:
                "อินดี้ ไทยจีโอ คือสมบัติของมหาลัยเรา อย่าให้มันหายไป เอือกกกกกกก",
              polarity: "negative"
            },
            {
              name:
                "อยากให้มีจริงๆค่ะ เพราะหารีวิวยากมากกกกกกก บางทีมันก็ไม่เป็นหลักเป็นแหล่ง บางทีรุ่นพี่โพสต์หน้าเฟซตัวเองแล้วไม่ได้เปิดพับลิกอะไรแบบนี้ค่ะ แล้วหาคนตอบในกลุ่มในเฟซเดี๋ยวนี้ก็ยิ่งยาก ไม่ค่อยมีคนเข้ามาตอบกันแล้ว",
              polarity: "negative"
            },
            {
              name: "จุฟๆ",
              polarity: "neutral"
            },
            {
              name: "ไม่นะ",
              polarity: "neutral"
            },
            {
              name: "วิชาเลือกของคณะบริหาร อยากให้มีโอกาสเลือกได้มากกว่านี้",
              polarity: "neutral"
            },
            {
              name:
                "ขอให้โปรเจคของน้องผ่านไปได้ด้วยดีนะคะ ถึงพี่จะจบจากที่นี่ไปแล้วแต่อยากทำแบบสอบถามนี้ แล้วก็ขอให้แบบสอบถามนี้มีประโยชน์ก็น้องรุ่นต่อๆ ไปด้วยนะคะ ขอบคุณค่ะ",
              polarity: "positive"
            },
            {
              name: "ระบบ ว่าเรียนวิชาเลือกครบหรือยัง",
              polarity: "neutral"
            },
            {
              name: "ต้องการให้ไม่ซับซ้อน เข้าถึงง่าย",
              polarity: "positive"
            },
            {
              name: "ขอบคุณที่ทำอะไรแบบนี้ออกมาจ้า เป็นประโยชน์มากๆเลย",
              polarity: "positive"
            },
            {
              name: "อยากได้รายละเอียดเยอะๆ และวิชาที่ติดดาว ให้คะแนนเป็นดาว",
              polarity: "positive"
            },
            {
              name:
                "https://docs.google.com/spreadsheets/d/1_20jscySDD_1o-2AmFLQ16XLDCEe1Q0xwJOS7SuEAdU/edit#gid=0 รีวิวที่มีการส่งต่อๆกันในคณะไอที :)\nอยากให้มีแบบเลือกว่าตัวเองอยู่คณะนี้ชั้นปีนี้ต้องเก็บหมวดอะไรกี่หน่วยกิต มีแจ้งเป็นทิปว่าถ้าลงหมวดนี้เต็มหน่วยกิตแล้วลงอีกมันจะปัดเป็นหมวดเสรี ไรงี้",
              polarity: "positive"
            },
            {
              name: "สู้ๆนะครับ",
              polarity: "positive"
            },
            {
              name: "ไม่มีค้าบ\n",
              polarity: "neutral"
            },
            {
              name:
                "วิชาที่ใช่ไม่ได้เลือก วิชาที่เลือกก็ไม่ใช่ ต้องแย่งกันลงให้จบๆไป ดูไม่กี่อย่าง เกรดง่าย งานน้อย ไม่เข้มงวดเรื่องเข้าเรียน สอนดี",
              polarity: "positive"
            },
            {
              name:
                "ถ้าจะทำจริงควรมีให้หลากหลาย เพราะปัญหาที่เจอคือคนไม่ยอมบอกกันว่าวิชานั้นๆเป็นไง แต่ตัวเองก็อยากได้รีวิววิชา ควรมีระบบให้รีวิววิชาที่ตัวเองเคยลงมาแลกเปลี่ยนกันถ้าไม่เคยรีวิวก็ดูข้อมูลไม่ได้ เป็นต้น",
              polarity: "neutral"
            },
            {
              name:
                "ควรมีการระบุอัพเดทคชข้อมูลของผู้สอน และปีที่ได้เรียน จากผู้ที่เคยเรียน เพราะบางวิชา เมื่อเราหารีวิวแล้วของปีก่อนหรือเทอมก่อน คิดว่ามันน่าสนใจ แต่พอมาลงในเทอมปัจจุบัน กลับพบว่ามีการเปลี่ยนผู้สอน ทำให้เทคนิคและวิธีการสอนต่างกัน ซึ่งเป็นเรื่องน่าเสียดายที่เราตั้งใจจะลง แต่กลับมีการเปลี่ยนแปลงข้อมูล",
              polarity: "positive"
            },
            {
              name: "อย่าบอกจารย์นะ จุ๊ๆ",
              polarity: "neutral"
            },
            {
              name:
                "บางคณะวิชาเลือกมีให้เลือกน้อยเกินไปค่ะ บางวิชาถ้าอยากเรียนก็ไม่สามารถเรียนได้",
              polarity: "negative"
            },
            {
              name:
                "ปีนี้มีให้ลงวิขาเลือก1ตัว แต่ในหมวดที่บังคับลงดันมีวิขาให้เลือกแค่วิชาเดียว แบบนี้ก็เหมือนบังคับลง",
              polarity: "negative"
            },
            {
              name: "สู้ๆนะจ้ะ",
              polarity: "positive"
            },
            {
              name: "สู้ๆนะครับ <3",
              polarity: "positive"
            },
            {
              name:
                "เป็นสถาบันที่มีวิชาเลือกน้อยมากๆ หลายๆวิชาต่างคณะคือน่าเรียนมากแต่จำกัดเฉพาะคนในคณะ โดยเฉพาะสายภาษา วิชาเลือกก็เหมือนสิ่งที่น่าสนใจอีกอย่างของเรา อยากให้มีให้หลายหลาย เราอยากเรียนภาษาที่3อย่างญี่ปุ่นหรือเกาหลีคือหาไม่ได้เลย แอบอิจฉาม.อื่น การจะทำระบบสืบค้นคือดีมากๆ ค่ะ เพราะนี่ก็ลงได้เพราะถามจากรุ่นพี่เป็นส่วนใหญ่",
              polarity: "positive"
            },
            {
              name: "เราจะผ่านมันไปด้วยกันค้าบ",
              polarity: "neutral"
            },
            {
              name:
                "อยากได้ระบบที่หาข้อมูลที่ความน่าเชื่อถือ ช่วยในการตัดสินใจ และไม่ผิดหวัง",
              polarity: "positive"
            },
            {
              name: "บอกรหัสวิชาและภาคเรียนที่เปิดสอน",
              polarity: "neutral"
            },
            {
              name: "ไม่มี",
              polarity: "neutral"
            },
            {
              name:
                "ขอบคุณโปรเจคดีๆ ถ้าทำได้ก็ดี แต่อาจจะเหนื่อยหน่อย เป็นกำลังใจให้นะ แต่ถ้าทำนะ บางวิชาอาจไม่มีคนลงเลยก็ได้ ว้ะฮ่าๆ",
              polarity: "positive"
            },
            {
              name: "สู้ๆค่ะ พี่เฟิร์สสสสสสสสส",
              polarity: "positive"
            },
            {
              name:
                "ฟังก์ชั่นการเข้าสู่ระบบเพื่อเขียนรีวิว หมายถึงการล็อคอินไปเขียนใช่ไหม ถ้าใช่ก็อาจจะไม่ต้องสอบถามก็ได้ เพราะมันแค่การล็อคอิน ถ้าหมายถึงการเขียนรีวิว ก็ใช้คำนี้สั้น ๆ เลย คนจะได้ไม่สงสัยแบบนี้ด้วยครับ",
              polarity: "positive"
            },
            {
              name: "อิอิ",
              polarity: "neutral"
            },
            {
              name: "ระบบให้ดาว",
              polarity: "neutral"
            },
            {
              name: "สู้ๆ",
              polarity: "positive"
            },
            {
              name:
                "บอกด้วยว่าอ.อะไรเป็นผู้สอน เพราะวิชาเดิม แต่เปลี่ยนอ. ความยากง่ายก็จะเปลี่ยนไป",
              polarity: "negative"
            },
            {
              name: "สู้ๆฮะ",
              polarity: "positive"
            },
            {
              name: "ระบบกดโหวตกระทู้(ให้ดาว)",
              polarity: "neutral"
            },
            {
              name:
                "แนะนำว่าให้มีฟังก์ชันให้ search ได้จากว่าคณะของตัวเอง ลงอะไรได้บ้าง แล้วก็แนะนำว่าให้ดึงข้อมูลว่ามีวิชาอะไรบ้าง เรียนที่ไหน เวลาไหน อะไรพวกนี้จาก reg โดยตรงเลย ไม่ต้องมารอให้มี user เข้ามาทำการเพิ่มวิชาด้วยตนเองนะจ๊ะ จากพี่มงมง",
              polarity: "neutral"
            },
            {
              name: "easy to use dude",
              polarity: "neutral"
            },
            {
              name: "เว็บดูยากมากครับ เวลาที่จะเบือกวิชาเลือก",
              polarity: "negative"
            },
            {
              name:
                "อยากให้มีอธิบายว่าเรียนเกี่ยวกับอะไร เป็นยังไง ยังว่างอยู่มั้ย รับกี่คน",
              polarity: "neutral"
            },
            {
              name:
                "อยากให้บอกว่าเนื้อหาวิชานี้อาจารย์สอนยังไง มีเนื้อหาเกี่ยวกับอะไรบ้าง",
              polarity: "neutral"
            },
            {
              name:
                "อยากให้บอกเกี่ยวกับการเก็บคะแนน และหัวข้อที่จะเรียน อยากให้listมาเลย",
              polarity: "neutral"
            },
            {
              name:
                "ในระบบเก่าวิชาเลือกเสรีต้องไปหาเอง ถ้ามีโปรแกรมมาช่วยหาก็ดี",
              polarity: "positive"
            },
            {
              name: "บอกรายละเอียดวิชากับรีวิวอาจารย์",
              polarity: "neutral"
            },
            {
              name: "รีวิวอาจารย์ รีวิวเนื้อหาการเรียน",
              polarity: "neutral"
            },
            {
              name:
                "รู้สึกสนใจโปรเจคนี้นะคะ มันถือว่ามันเป็นการเปิดทางเลือกให้กับเด็กบางคนที่ไม่รู้ว่าวิชานี้ วิชานี้เรียนอะไร แล้วก็อยากให้แสดงความคิดว่าวิชานี้เป็นยังไง ครูดุมั้ย เรียนยากมั้ย",
              polarity: "negative"
            }
          ]
        }
      ]
    };
  }
};
</script>

<style></style>
